[{"id":19995,"title":"Avatar","genres":["Action","Adventure","Fantasy","Science Fiction"],"release_year":2009,"overview":"In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.","budget":237000000,"revenue":2787965087},{"id":285,"title":"Pirates of the Caribbean: At World's End","genres":["Adventure","Fantasy","Action"],"release_year":2007,"overview":"Captain Barbossa, long believed to be dead, has come back to life and is headed to the edge of the Earth with Will Turner and Elizabeth Swann. But nothing is quite as it seems.","budget":300000000,"revenue":961000000},{"id":206647,"title":"Spectre","genres":["Action","Adventure","Crime"],"release_year":2015,"overview":"A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.","budget":245000000,"revenue":880674609},{"id":49026,"title":"The Dark Knight Rises","genres":["Action","Crime","Drama","Thriller"],"release_year":2012,"overview":"Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.","budget":250000000,"revenue":1084939099},{"id":49529,"title":"John Carter","genres":["Action","Adventure","Science Fiction"],"release_year":2012,"overview":"John Carter is a war-weary, former military captain who's inexplicably transported to the mysterious and exotic planet of Barsoom (Mars) and reluctantly becomes embroiled in an epic conflict. It's a world on the brink of collapse, and Carter rediscovers his humanity when he realizes the survival of Barsoom and its people rests in his hands.","budget":260000000,"revenue":284139100},{"id":559,"title":"Spider-Man 3","genres":["Fantasy","Action","Adventure"],"release_year":2007,"overview":"The seemingly invincible Spider-Man goes up against an all-new crop of villain – including the shape-shifting Sandman. While Spider-Man’s superpowers are altered by an alien organism, his alter ego, Peter Parker, deals with nemesis Eddie Brock and also gets caught up in a love triangle.","budget":258000000,"revenue":890871626},{"id":38757,"title":"Tangled","genres":["Animation","Family"],"release_year":2010,"overview":"When the kingdom's most wanted-and most charming-bandit Flynn Rider hides out in a mysterious tower, he's taken hostage by Rapunzel, a beautiful and feisty tower-bound teen with 70 feet of magical, golden hair. Flynn's curious captor, who's looking for her ticket out of the tower where she's been locked away for years, strikes a deal with the handsome thief and the unlikely duo sets off on an action-packed escapade, complete with a super-cop horse, an over-protective chameleon and a gruff gang of pub thugs.","budget":260000000,"revenue":591794936},{"id":99861,"title":"Avengers: Age of Ultron","genres":["Action","Adventure","Science Fiction"],"release_year":2015,"overview":"When Tony Stark tries to jumpstart a dormant peacekeeping program, things go awry and Earth’s Mightiest Heroes are put to the ultimate test as the fate of the planet hangs in the balance. As the villainous Ultron emerges, it is up to The Avengers to stop him from enacting his terrible plans, and soon uneasy alliances and unexpected action pave the way for an epic and unique global adventure.","budget":280000000,"revenue":1405403694},{"id":767,"title":"Harry Potter and the Half-Blood Prince","genres":["Adventure","Fantasy","Family"],"release_year":2009,"overview":"As Harry begins his sixth year at Hogwarts, he discovers an old book marked as 'Property of the Half-Blood Prince', and begins to learn more about Lord Voldemort's dark past.","budget":250000000,"revenue":933959197}]