[
  {
    "id": 19995,
    "title": "Avatar",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy",
      "Science Fiction"
    ],
    "release_year": 2009,
    "overview": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
    "popularity": 150.437577,
    "vote_average": 7.2,
    "vote_count": 11800,
    "budget": 237000000,
    "revenue": 2787965087
  },
  {
    "id": 285,
    "title": "Pirates of the Caribbean: At World's End",
    "genres": [
      "Adventure",
      "Fantasy",
      "Action"
    ],
    "release_year": 2007,
    "overview": "Captain Barbossa, long believed to be dead, has come back to life and is headed to the edge of the Earth with Will Turner and Elizabeth Swann. But nothing is quite as it seems.",
    "popularity": 139.082615,
    "vote_average": 6.9,
    "vote_count": 4500,
    "budget": 300000000,
    "revenue": 961000000
  },
  {
    "id": 206647,
    "title": "Spectre",
    "genres": [
      "Action",
      "Adventure",
      "Crime"
    ],
    "release_year": 2015,
    "overview": "A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.",
    "popularity": 107.376788,
    "vote_average": 6.3,
    "vote_count": 4466,
    "budget": 245000000,
    "revenue": 880674609
  },
  {
    "id": 49026,
    "title": "The Dark Knight Rises",
    "genres": [
      "Action",
      "Crime",
      "Drama",
      "Thriller"
    ],
    "release_year": 2012,
    "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
    "popularity": 112.31295,
    "vote_average": 7.6,
    "vote_count": 9106,
    "budget": 250000000,
    "revenue": 1084939099
  },
  {
    "id": 49529,
    "title": "John Carter",
    "genres": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "release_year": 2012,
    "overview": "John Carter is a war-weary, former military captain who's inexplicably transported to the mysterious and exotic planet of Barsoom (Mars) and reluctantly becomes embroiled in an epic conflict. It's a world on the brink of collapse, and Carter rediscovers his humanity when he realizes the survival of Barsoom and its people rests in his hands.",
    "popularity": 43.926995,
    "vote_average": 6.1,
    "vote_count": 2124,
    "budget": 260000000,
    "revenue": 284139100
  },
  {
    "id": 559,
    "title": "Spider-Man 3",
    "genres": [
      "Fantasy",
      "Action",
      "Adventure"
    ],
    "release_year": 2007,
    "overview": "The seemingly invincible Spider-Man goes up against an all-new crop of villain – including the shape-shifting Sandman. While Spider-Man’s superpowers are altered by an alien organism, his alter ego, Peter Parker, deals with nemesis Eddie Brock and also gets caught up in a love triangle.",
    "popularity": 115.699814,
    "vote_average": 5.9,
    "vote_count": 3576,
    "budget": 258000000,
    "revenue": 890871626
  },
  {
    "id": 38757,
    "title": "Tangled",
    "genres": [
      "Animation",
      "Family"
    ],
    "release_year": 2010,
    "overview": "When the kingdom's most wanted-and most charming-bandit Flynn Rider hides out in a mysterious tower, he's taken hostage by Rapunzel, a beautiful and feisty tower-bound teen with 70 feet of magical, golden hair. Flynn's curious captor, who's looking for her ticket out of the tower where she's been locked away for years, strikes a deal with the handsome thief and the unlikely duo sets off on an action-packed escapade, complete with a super-cop horse, an over-protective chameleon and a gruff gang of pub thugs.",
    "popularity": 48.681969,
    "vote_average": 7.4,
    "vote_count": 3330,
    "budget": 260000000,
    "revenue": 591794936
  },
  {
    "id": 99861,
    "title": "Avengers: Age of Ultron",
    "genres": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "release_year": 2015,
    "overview": "When Tony Stark tries to jumpstart a dormant peacekeeping program, things go awry and Earth’s Mightiest Heroes are put to the ultimate test as the fate of the planet hangs in the balance. As the villainous Ultron emerges, it is up to The Avengers to stop him from enacting his terrible plans, and soon uneasy alliances and unexpected action pave the way for an epic and unique global adventure.",
    "popularity": 134.279229,
    "vote_average": 7.3,
    "vote_count": 6767,
    "budget": 280000000,
    "revenue": 1405403694
  },
  {
    "id": 767,
    "title": "Harry Potter and the Half-Blood Prince",
    "genres": [
      "Adventure",
      "Fantasy",
      "Family"
    ],
    "release_year": 2009,
    "overview": "As Harry begins his sixth year at Hogwarts, he discovers an old book marked as 'Property of the Half-Blood Prince', and begins to learn more about Lord Voldemort's dark past.",
    "popularity": 98.885637,
    "vote_average": 7.4,
    "vote_count": 5293,
    "budget": 250000000,
    "revenue": 933959197
  },
  {
    "id": 209112,
    "title": "Batman v Superman: Dawn of Justice",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "release_year": 2016,
    "overview": "Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it’s ever known before.",
    "popularity": 155.790452,
    "vote_average": 5.7,
    "vote_count": 7004,
    "budget": 250000000,
    "revenue": 873260194
  },
  {
    "id": 1452,
    "title": "Superman Returns",
    "genres": [
      "Adventure",
      "Fantasy",
      "Action",
      "Science Fiction"
    ],
    "release_year": 2006,
    "overview": "Superman returns to discover his 5-year absence has allowed Lex Luthor to walk free, and that those he was closest too felt abandoned and have moved on. Luthor plots his ultimate revenge that could see millions killed and change the face of the planet forever, as well as ridding himself of the Man of Steel.",
    "popularity": 57.925623,
    "vote_average": 5.4,
    "vote_count": 1400,
    "budget": 270000000,
    "revenue": 391081192
  },
  {
    "id": 10764,
    "title": "Quantum of Solace",
    "genres": [
      "Adventure",
      "Action",
      "Thriller",
      "Crime"
    ],
    "release_year": 2008,
    "overview": "Quantum of Solace continues the adventures of James Bond after Casino Royale. Betrayed by Vesper, the woman he loved, 007 fights the urge to make his latest mission personal. Pursuing his determination to uncover the truth, Bond and M interrogate Mr. White, who reveals that the organization that blackmailed Vesper is far more complex and dangerous than anyone had imagined.",
    "popularity": 107.928811,
    "vote_average": 6.1,
    "vote_count": 2965,
    "budget": 200000000,
    "revenue": 586090727
  },
  {
    "id": 58,
    "title": "Pirates of the Caribbean: Dead Man's Chest",
    "genres": [
      "Adventure",
      "Fantasy",
      "Action"
    ],
    "release_year": 2006,
    "overview": "Captain Jack Sparrow works his way out of a blood debt with the ghostly Davey Jones, he also attempts to avoid eternal damnation.",
    "popularity": 145.847379,
    "vote_average": 7,
    "vote_count": 5246,
    "budget": 200000000,
    "revenue": 1065659812
  },
  {
    "id": 57201,
    "title": "The Lone Ranger",
    "genres": [
      "Action",
      "Adventure",
      "Western"
    ],
    "release_year": 2013,
    "overview": "The Texas Rangers chase down a gang of outlaws led by Butch Cavendish, but the gang ambushes the Rangers, seemingly killing them all. One survivor is found, however, by an American Indian named Tonto, who nurses him back to health. The Ranger, donning a mask and riding a white stallion named Silver, teams up with Tonto to bring the unscrupulous gang and others of that ilk to justice.",
    "popularity": 49.046956,
    "vote_average": 5.9,
    "vote_count": 2311,
    "budget": 255000000,
    "revenue": 89289910
  },
  {
    "id": 49521,
    "title": "Man of Steel",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy",
      "Science Fiction"
    ],
    "release_year": 2013,
    "overview": "A young boy learns that he has extraordinary powers and is not of this earth. As a young man, he journeys to discover where he came from and what he was sent here to do. But the hero in him must emerge if he is to save the world from annihilation and become the symbol of hope for all mankind.",
    "popularity": 99.398009,
    "vote_average": 6.5,
    "vote_count": 6359,
    "budget": 225000000,
    "revenue": 662845518
  },
  {
    "id": 2454,
    "title": "The Chronicles of Narnia: Prince Caspian",
    "genres": [
      "Adventure",
      "Family",
      "Fantasy"
    ],
    "release_year": 2008,
    "overview": "One year after their incredible adventures in the Lion, the Witch and the Wardrobe, Peter, Edmund, Lucy and Susan Pevensie return to Narnia to aid a young prince whose life has been threatened by the evil King Miraz. Now, with the help of a colorful cast of new characters, including Trufflehunter the badger and Nikabrik the dwarf, the Pevensie clan embarks on an incredible quest to ensure that Narnia is returned to its rightful heir.",
    "popularity": 53.978602,
    "vote_average": 6.3,
    "vote_count": 1630,
    "budget": 225000000,
    "revenue": 419651413
  },
  {
    "id": 24428,
    "title": "The Avengers",
    "genres": [
      "Science Fiction",
      "Action",
      "Adventure"
    ],
    "release_year": 2012,
    "overview": "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
    "popularity": 144.448633,
    "vote_average": 7.4,
    "vote_count": 11776,
    "budget": 220000000,
    "revenue": 1519557910
  },
  {
    "id": 1865,
    "title": "Pirates of the Caribbean: On Stranger Tides",
    "genres": [
      "Adventure",
      "Action",
      "Fantasy"
    ],
    "release_year": 2011,
    "overview": "Captain Jack Sparrow crosses paths with a woman from his past, and he's not sure if it's love -- or if she's a ruthless con artist who's using him to find the fabled Fountain of Youth. When she forces him aboard the Queen Anne's Revenge, the ship of the formidable pirate Blackbeard, Jack finds himself on an unexpected adventure in which he doesn't know who to fear more: Blackbeard or the woman from his past.",
    "popularity": 135.413856,
    "vote_average": 6.4,
    "vote_count": 4948,
    "budget": 380000000,
    "revenue": 1045713802
  },
  {
    "id": 41154,
    "title": "Men in Black 3",
    "genres": [
      "Action",
      "Comedy",
      "Science Fiction"
    ],
    "release_year": 2012,
    "overview": "Agents J (Will Smith) and K (Tommy Lee Jones) are back...in time. J has seen some inexplicable things in his 15 years with the Men in Black, but nothing, not even aliens, perplexes him as much as his wry, reticent partner. But when K's life and the fate of the planet are put at stake, Agent J will have to travel back in time to put things right. J discovers that there are secrets to the universe that K never told him - secrets that will reveal themselves as he teams up with the young Agent K (Josh Brolin) to save his partner, the agency, and the future of humankind.",
    "popularity": 52.035179,
    "vote_average": 6.2,
    "vote_count": 4160,
    "budget": 225000000,
    "revenue": 624026776
  },
  {
    "id": 122917,
    "title": "The Hobbit: The Battle of the Five Armies",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "release_year": 2014,
    "overview": "Immediately after the events of The Desolation of Smaug, Bilbo and the dwarves try to defend Erebor's mountain of treasure from others who claim it: the men of the ruined Laketown and the elves of Mirkwood. Meanwhile an army of Orcs led by Azog the Defiler is marching on Erebor, fueled by the rise of the dark lord Sauron. Dwarves, elves and men must unite, and the hope for Middle-Earth falls into Bilbo's hands.",
    "popularity": 120.965743,
    "vote_average": 7.1,
    "vote_count": 4760,
    "budget": 250000000,
    "revenue": 956019788
  },
  {
    "id": 1930,
    "title": "The Amazing Spider-Man",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "release_year": 2012,
    "overview": "Peter Parker is an outcast high schooler abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben and Aunt May. Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance – leading him directly to Oscorp and the lab of Dr. Curt Connors, his father's former partner. As Spider-Man is set on a collision course with Connors' alter ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.",
    "popularity": 89.866276,
    "vote_average": 6.5,
    "vote_count": 6586,
    "budget": 215000000,
    "revenue": 752215857
  },
  {
    "id": 20662,
    "title": "Robin Hood",
    "genres": [
      "Action",
      "Adventure"
    ],
    "release_year": 2010,
    "overview": "When soldier Robin happens upon the dying Robert of Loxley, he promises to return the man's sword to his family in Nottingham. There, he assumes Robert's identity; romances his widow, Marion; and draws the ire of the town's sheriff and King John's henchman, Godfrey.",
    "popularity": 37.668301,
    "vote_average": 6.2,
    "vote_count": 1398,
    "budget": 200000000,
    "revenue": 310669540
  },
  {
    "id": 57158,
    "title": "The Hobbit: The Desolation of Smaug",
    "genres": [
      "Adventure",
      "Fantasy"
    ],
    "release_year": 2013,
    "overview": "The Dwarves, Bilbo and Gandalf have successfully escaped the Misty Mountains, and Bilbo has gained the One Ring. They all continue their journey to get their gold back from the Dragon, Smaug.",
    "popularity": 94.370564,
    "vote_average": 7.6,
    "vote_count": 4524,
    "budget": 250000000,
    "revenue": 958400000
  },
  {
    "id": 2268,
    "title": "The Golden Compass",
    "genres": [
      "Adventure",
      "Fantasy"
    ],
    "release_year": 2007,
    "overview": "After overhearing a shocking secret, precocious orphan Lyra Belacqua trades her carefree existence roaming the halls of Jordan College for an otherworldly adventure in the far North, unaware that it's part of her destiny.",
    "popularity": 42.990906,
    "vote_average": 5.8,
    "vote_count": 1303,
    "budget": 180000000,
    "revenue": 372234864
  },
  {
    "id": 254,
    "title": "King Kong",
    "genres": [
      "Adventure",
      "Drama",
      "Action"
    ],
    "release_year": 2005,
    "overview": "In 1933 New York, an overly ambitious movie producer coerces his cast and hired ship crew to travel to mysterious Skull Island, where they encounter Kong, a giant ape who is immediately smitten with the leading lady.",
    "popularity": 61.22601,
    "vote_average": 6.6,
    "vote_count": 2337,
    "budget": 207000000,
    "revenue": 550000000
  },
  {
    "id": 597,
    "title": "Titanic",
    "genres": [
      "Drama",
      "Romance",
      "Thriller"
    ],
    "release_year": 1997,
    "overview": "84 years later, a 101-year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.",
    "popularity": 100.025899,
    "vote_average": 7.5,
    "vote_count": 7562,
    "budget": 200000000,
    "revenue": 1845034188
  },
  {
    "id": 271110,
    "title": "Captain America: Civil War",
    "genres": [
      "Adventure",
      "Action",
      "Science Fiction"
    ],
    "release_year": 2016,
    "overview": "Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.",
    "popularity": 198.372395,
    "vote_average": 7.1,
    "vote_count": 7241,
    "budget": 250000000,
    "revenue": 1153304495
  },
  {
    "id": 44833,
    "title": "Battleship",
    "genres": [
      "Thriller",
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "release_year": 2012,
    "overview": "When mankind beams a radio signal into space, a reply comes from ‘Planet G’, in the form of several alien crafts that splash down in the waters off Hawaii. Lieutenant Alex Hopper is a weapons officer assigned to the USS John Paul Jones, part of an international naval coalition which becomes the world's last hope for survival as they engage the hostile alien force of unimaginable strength. While taking on the invaders, Hopper must also try to live up to the potential his brother, and his fiancée's father, Admiral Shane, expect of him.",
    "popularity": 64.928382,
    "vote_average": 5.5,
    "vote_count": 2114,
    "budget": 209000000,
    "revenue": 303025485
  },
  {
    "id": 135397,
    "title": "Jurassic World",
    "genres": [
      "Action",
      "Adventure",
      "Science Fiction",
      "Thriller"
    ],
    "release_year": 2015,
    "overview": "Twenty-two years after the events of Jurassic Park, Isla Nublar now features a fully functioning dinosaur theme park, Jurassic World, as originally envisioned by John Hammond.",
    "popularity": 418.708552,
    "vote_average": 6.5,
    "vote_count": 8662,
    "budget": 150000000,
    "revenue": 1513528810
  },
  {
    "id": 37724,
    "title": "Skyfall",
    "genres": [
      "Action",
      "Adventure",
      "Thriller"
    ],
    "release_year": 2012,
    "overview": "When Bond's latest assignment goes gravely wrong and agents around the world are exposed, MI6 is attacked forcing M to relocate the agency. These events cause her authority and position to be challenged by Gareth Mallory, the new Chairman of the Intelligence and Security Committee. With MI6 now compromised from both inside and out, M is left with one ally she can trust: Bond. 007 takes to the shadows - aided only by field agent, Eve - following a trail to the mysterious Silva, whose lethal and hidden motives have yet to reveal themselves.",
    "popularity": 93.004993,
    "vote_average": 6.9,
    "vote_count": 7604,
    "budget": 200000000,
    "revenue": 1108561013
  },
  {
    "id": 558,
    "title": "Spider-Man 2",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "release_year": 2004,
    "overview": "Peter Parker is going through a major identity crisis. Burned out from being Spider-Man, he decides to shelve his superhero alter ego, which leaves the city suffering in the wake of carnage left by the evil Doc Ock. In the meantime, Parker still can't act on his feelings for Mary Jane Watson, a girl he's loved since childhood.",
    "popularity": 35.149586,
    "vote_average": 6.7,
    "vote_count": 4321,
    "budget": 200000000,
    "revenue": 783766341
  },
  {
    "id": 68721,
    "title": "Iron Man 3",
    "genres": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "release_year": 2013,
    "overview": "When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution.",
    "popularity": 77.68208,
    "vote_average": 6.8,
    "vote_count": 8806,
    "budget": 200000000,
    "revenue": 1215439994
  },
  {
    "id": 12155,
    "title": "Alice in Wonderland",
    "genres": [
      "Family",
      "Fantasy",
      "Adventure"
    ],
    "release_year": 2010,
    "overview": "Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to consider whether to go through with the marriage and falls down a hole in the garden after spotting an unusual rabbit. Arriving in a strange and surreal place called 'Underland,' she finds herself in a world that resembles the nightmares she had as a child, filled with talking animals, villainous queens and knights, and frumious bandersnatches. Alice realizes that she is there for a reason – to conquer the horrific Jabberwocky and restore the rightful queen to her throne.",
    "popularity": 78.530105,
    "vote_average": 6.4,
    "vote_count": 4645,
    "budget": 200000000,
    "revenue": 1025491110
  },
  {
    "id": 36668,
    "title": "X-Men: The Last Stand",
    "genres": [
      "Adventure",
      "Action",
      "Science Fiction",
      "Thriller"
    ],
    "release_year": 2006,
    "overview": "When a cure is found to treat mutations, lines are drawn amongst the X-Men and The Brotherhood, a band of powerful mutants organized under Xavier's former ally, Magneto.",
    "popularity": 3.857526,
    "vote_average": 6.3,
    "vote_count": 3525,
    "budget": 210000000,
    "revenue": 459359555
  },
  {
    "id": 62211,
    "title": "Monsters University",
    "genres": [
      "Animation",
      "Family"
    ],
    "release_year": 2013,
    "overview": "A look at the relationship between Mike and Sulley during their days at Monsters University — when they weren't necessarily the best of friends.",
    "popularity": 89.186492,
    "vote_average": 7,
    "vote_count": 3528,
    "budget": 200000000,
    "revenue": 743559607
  },
  {
    "id": 8373,
    "title": "Transformers: Revenge of the Fallen",
    "genres": [
      "Science Fiction",
      "Action",
      "Adventure"
    ],
    "release_year": 2009,
    "overview": "Sam Witwicky leaves the Autobots behind for a normal life. But when his mind is filled with cryptic symbols, the Decepticons target him and he is dragged back into the Transformers' war.",
    "popularity": 21.939663,
    "vote_average": 6,
    "vote_count": 3138,
    "budget": 150000000,
    "revenue": 836297228
  },
  {
    "id": 91314,
    "title": "Transformers: Age of Extinction",
    "genres": [
      "Science Fiction",
      "Action",
      "Adventure"
    ],
    "release_year": 2014,
    "overview": "As humanity picks up the pieces, following the conclusion of \"Transformers: Dark of the Moon,\" Autobots and Decepticons have all but vanished from the face of the planet. However, a group of powerful, ingenious businessman and scientists attempt to learn from past Transformer incursions and push the boundaries of technology beyond what they can control - all while an ancient, powerful Transformer menace sets Earth in his cross-hairs.",
    "popularity": 116.840296,
    "vote_average": 5.8,
    "vote_count": 3095,
    "budget": 210000000,
    "revenue": 1091405097
  },
  {
    "id": 68728,
    "title": "Oz: The Great and Powerful",
    "genres": [
      "Fantasy",
      "Adventure",
      "Family"
    ],
    "release_year": 2013,
    "overview": "Oscar Diggs, a small-time circus illusionist and con-artist, is whisked from Kansas to the Land of Oz where the inhabitants assume he's the great wizard of prophecy, there to save Oz from the clutches of evil.",
    "popularity": 46.985445,
    "vote_average": 5.7,
    "vote_count": 3530,
    "budget": 200000000,
    "revenue": 491868548
  },
  {
    "id": 102382,
    "title": "The Amazing Spider-Man 2",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "release_year": 2014,
    "overview": "For Peter Parker, life is busy. Between taking out the bad guys as Spider-Man and spending time with the person he loves, Gwen Stacy, high school graduation cannot come quickly enough. Peter has not forgotten about the promise he made to Gwen’s father to protect her by staying away, but that is a promise he cannot keep. Things will change for Peter when a new villain, Electro, emerges, an old friend, Harry Osborn, returns, and Peter uncovers new clues about his past.",
    "popularity": 89.270217,
    "vote_average": 6.5,
    "vote_count": 4179,
    "budget": 200000000,
    "revenue": 705717432
  },
  {
    "id": 20526,
    "title": "TRON: Legacy",
    "genres": [
      "Adventure",
      "Action",
      "Science Fiction"
    ],
    "release_year": 2010,
    "overview": "Sam Flynn, the tech-savvy and daring son of Kevin Flynn, investigates his father's disappearance and is pulled into The Grid. With the help of a mysterious program named Quorra, Sam quests to stop evil dictator Clu from crossing into the real world.",
    "popularity": 73.79505,
    "vote_average": 6.3,
    "vote_count": 2841,
    "budget": 170000000,
    "revenue": 400062763
  },
  {
    "id": 49013,
    "title": "Cars 2",
    "genres": [
      "Animation",
      "Family",
      "Adventure",
      "Comedy"
    ],
    "release_year": 2011,
    "overview": "Star race car Lightning McQueen and his pal Mater head overseas to compete in the World Grand Prix race. But the road to the championship becomes rocky as Mater gets caught up in an intriguing adventure of his own: international espionage.",
    "popularity": 49.98659,
    "vote_average": 5.8,
    "vote_count": 2033,
    "budget": 200000000,
    "revenue": 559852396
  },
  {
    "id": 44912,
    "title": "Green Lantern",
    "genres": [
      "Adventure",
      "Action",
      "Thriller",
      "Science Fiction"
    ],
    "release_year": 2011,
    "overview": "For centuries, a small but powerful force of warriors called the Green Lantern Corps has sworn to keep intergalactic order. Each Green Lantern wears a ring that grants him superpowers. But when a new enemy called Parallax threatens to destroy the balance of power in the Universe, their fate and the fate of Earth lie in the hands of the first human ever recruited.",
    "popularity": 51.872839,
    "vote_average": 5.1,
    "vote_count": 2487,
    "budget": 200000000,
    "revenue": 219851172
  },
  {
    "id": 10193,
    "title": "Toy Story 3",
    "genres": [
      "Animation",
      "Family",
      "Comedy"
    ],
    "release_year": 2010,
    "overview": "Woody, Buzz, and the rest of Andy's toys haven't been played with in years. With Andy about to go to college, the gang find themselves accidentally left at a nefarious day care center. The toys must band together to escape and return home to Andy.",
    "popularity": 59.995418,
    "vote_average": 7.6,
    "vote_count": 4597,
    "budget": 200000000,
    "revenue": 1066969703
  },
  {
    "id": 534,
    "title": "Terminator Salvation",
    "genres": [
      "Action",
      "Science Fiction",
      "Thriller"
    ],
    "release_year": 2009,
    "overview": "All grown up in post-apocalyptic 2018, John Connor must lead the resistance of humans against the increasingly dominating militaristic robots. But when Marcus Wright appears, his existence confuses the mission as Connor tries to determine whether Wright has come from the future or the past -- and whether he's friend or foe.",
    "popularity": 71.862892,
    "vote_average": 5.9,
    "vote_count": 2463,
    "budget": 200000000,
    "revenue": 371353001
  },
  {
    "id": 168259,
    "title": "Furious 7",
    "genres": [
      "Action"
    ],
    "release_year": 2015,
    "overview": "Deckard Shaw seeks revenge against Dominic Toretto and his family for his comatose brother.",
    "popularity": 102.322217,
    "vote_average": 7.3,
    "vote_count": 4176,
    "budget": 190000000,
    "revenue": 1506249360
  },
  {
    "id": 72190,
    "title": "World War Z",
    "genres": [
      "Action",
      "Drama",
      "Horror",
      "Science Fiction",
      "Thriller"
    ],
    "release_year": 2013,
    "overview": "Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls.",
    "popularity": 81.834855,
    "vote_average": 6.7,
    "vote_count": 5560,
    "budget": 200000000,
    "revenue": 531865000
  },
  {
    "id": 127585,
    "title": "X-Men: Days of Future Past",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy",
      "Science Fiction"
    ],
    "release_year": 2014,
    "overview": "The ultimate X-Men ensemble fights a war for the survival of the species across two time periods as they join forces with their younger selves in an epic battle that must change the past – to save our future.",
    "popularity": 118.078691,
    "vote_average": 7.5,
    "vote_count": 6032,
    "budget": 250000000,
    "revenue": 747862775
  },
  {
    "id": 54138,
    "title": "Star Trek Into Darkness",
    "genres": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "release_year": 2013,
    "overview": "When the crew of the Enterprise is called back home, they find an unstoppable force of terror from within their own organization has detonated the fleet and everything it stands for, leaving our world in a state of crisis.  With a personal score to settle, Captain Kirk leads a manhunt to a war-zone world to capture a one man weapon of mass destruction. As our heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Kirk has left: his crew.",
    "popularity": 78.291018,
    "vote_average": 7.4,
    "vote_count": 4418,
    "budget": 190000000,
    "revenue": 467365246
  },
  {
    "id": 81005,
    "title": "Jack the Giant Slayer",
    "genres": [
      "Action",
      "Family",
      "Fantasy"
    ],
    "release_year": 2013,
    "overview": "The story of an ancient war that is reignited when a young farmhand unwittingly opens a gateway between our world and a fearsome race of giants. Unleashed on the Earth for the first time in centuries, the giants strive to reclaim the land they once lost, forcing the young man, Jack into the battle of his life to stop them. Fighting for a kingdom, its people, and the love of a brave princess, he comes face to face with the unstoppable warriors he thought only existed in legend–and gets the chance to become a legend himself.",
    "popularity": 43.349855,
    "vote_average": 5.5,
    "vote_count": 2598,
    "budget": 195000000,
    "revenue": 197687603
  },
  {
    "id": 64682,
    "title": "The Great Gatsby",
    "genres": [
      "Drama",
      "Romance"
    ],
    "release_year": 2013,
    "overview": "An adaptation of F. Scott Fitzgerald's Long Island-set novel, where Midwesterner Nick Carraway is lured into the lavish world of his neighbor, Jay Gatsby. Soon enough, however, Carraway will see through the cracks of Gatsby's nouveau riche existence, where obsession, madness, and tragedy await.",
    "popularity": 61.196071,
    "vote_average": 7.3,
    "vote_count": 3769,
    "budget": 105000000,
    "revenue": 351040419
  },
  {
    "id": 9543,
    "title": "Prince of Persia: The Sands of Time",
    "genres": [
      "Adventure",
      "Fantasy",
      "Action",
      "Romance"
    ],
    "release_year": 2010,
    "overview": "A rogue prince reluctantly joins forces with a mysterious princess and together, they race against dark forces to safeguard an ancient dagger capable of releasing the Sands of Time – gift from the gods that can reverse time and allow its possessor to rule the world.",
    "popularity": 62.169881,
    "vote_average": 6.2,
    "vote_count": 2317,
    "budget": 150000000,
    "revenue": 335154643
  },
  {
    "id": 68726,
    "title": "Pacific Rim",
    "genres": [
      "Action",
      "Science Fiction",
      "Adventure"
    ],
    "release_year": 2013,
    "overview": "When legions of monstrous creatures, known as Kaiju, started rising from the sea, a war began that would take millions of lives and consume humanity's resources for years on end. To combat the giant Kaiju, a special type of weapon was devised: massive robots, called Jaegers, which are controlled simultaneously by two pilots whose minds are locked in a neural bridge. But even the Jaegers are proving nearly defenseless in the face of the relentless Kaiju. On the verge of defeat, the forces defending mankind have no choice but to turn to two unlikely heroes—a washed-up former pilot (Charlie Hunnam) and an untested trainee (Rinko Kikuchi)—who are teamed to drive a legendary but seemingly obsolete Jaeger from the past. Together, they stand as mankind's last hope against the mounting apocalypse.",
    "popularity": 56.523205,
    "vote_average": 6.7,
    "vote_count": 4794,
    "budget": 180000000,
    "revenue": 407602906
  },
  {
    "id": 38356,
    "title": "Transformers: Dark of the Moon",
    "genres": [
      "Action",
      "Science Fiction",
      "Adventure"
    ],
    "release_year": 2011,
    "overview": "Sam Witwicky takes his first tenuous steps into adulthood while remaining a reluctant human ally of Autobot-leader Optimus Prime. The film centers around the space race between the USSR and the USA, suggesting there was a hidden Transformers role in it all that remains one of the planet's most dangerous secrets.",
    "popularity": 28.529607,
    "vote_average": 6.1,
    "vote_count": 3299,
    "budget": 195000000,
    "revenue": 1123746996
  },
  {
    "id": 217,
    "title": "Indiana Jones and the Kingdom of the Crystal Skull",
    "genres": [
      "Adventure",
      "Action"
    ],
    "release_year": 2008,
    "overview": "Set during the Cold War, the Soviets – led by sword-wielding Irina Spalko – are in search of a crystal skull which has supernatural powers related to a mystical Lost City of Gold. After being captured and then escaping from them, Indy is coerced to head to Peru at the behest of a young man whose friend – and Indy's colleague – Professor Oxley has been captured for his knowledge of the skull's whereabouts.",
    "popularity": 75.674458,
    "vote_average": 5.7,
    "vote_count": 2495,
    "budget": 185000000,
    "revenue": 786636033
  },
  {
    "id": 105864,
    "title": "The Good Dinosaur",
    "genres": [
      "Adventure",
      "Animation",
      "Family"
    ],
    "release_year": 2015,
    "overview": "An epic journey into the world of dinosaurs where an Apatosaurus named Arlo makes an unlikely human friend.",
    "popularity": 51.692953,
    "vote_average": 6.6,
    "vote_count": 1736,
    "budget": 175000000,
    "revenue": 331926147
  },
  {
    "id": 62177,
    "title": "Brave",
    "genres": [
      "Animation",
      "Adventure",
      "Comedy",
      "Family",
      "Action",
      "Fantasy"
    ],
    "release_year": 2012,
    "overview": "Brave is set in the mystical Scottish Highlands, where Mérida is the princess of a kingdom ruled by King Fergus and Queen Elinor. An unruly daughter and an accomplished archer, Mérida one day defies a sacred custom of the land and inadvertently brings turmoil to the kingdom. In an attempt to set things right, Mérida seeks out an eccentric old Wise Woman and is granted an ill-fated wish. Also figuring into Mérida’s quest — and serving as comic relief — are the kingdom’s three lords: the enormous Lord MacGuffin, the surly Lord Macintosh, and the disagreeable Lord Dingwall.",
    "popularity": 125.114374,
    "vote_average": 6.7,
    "vote_count": 4641,
    "budget": 185000000,
    "revenue": 538983207
  },
  {
    "id": 188927,
    "title": "Star Trek Beyond",
    "genres": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "release_year": 2016,
    "overview": "The USS Enterprise crew explores the furthest reaches of uncharted space, where they encounter a mysterious new enemy who puts them and everything the Federation stands for to the test.",
    "popularity": 65.352913,
    "vote_average": 6.6,
    "vote_count": 2568,
    "budget": 185000000,
    "revenue": 343471816
  },
  {
    "id": 10681,
    "title": "WALL·E",
    "genres": [
      "Animation",
      "Family"
    ],
    "release_year": 2008,
    "overview": "WALL·E is the last robot left on an Earth that has been overrun with garbage and all humans have fled to outer space. For 700 years he has continued to try and clean up the mess, but has developed some rather interesting human-like qualities. When a ship arrives with a sleek new type of robot, WALL·E thinks he's finally found a friend and stows away on the ship when it leaves.",
    "popularity": 66.390712,
    "vote_average": 7.8,
    "vote_count": 6296,
    "budget": 180000000,
    "revenue": 521311860
  },
  {
    "id": 5174,
    "title": "Rush Hour 3",
    "genres": [
      "Action",
      "Comedy",
      "Crime",
      "Thriller"
    ],
    "release_year": 2007,
    "overview": "After an attempted assassination on Ambassador Han, Inspector Lee and Detective Carter are back in action as they head to Paris to protect a French woman with knowledge of the Triads' secret leaders. Lee also holds secret meetings with a United Nations authority, but his personal struggles with a Chinese criminal mastermind named Kenji, which reveals that it's Lee's long-lost...brother.",
    "popularity": 22.57178,
    "vote_average": 6.1,
    "vote_count": 783,
    "budget": 140000000,
    "revenue": 258022233
  },
  {
    "id": 14161,
    "title": "2012",
    "genres": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "release_year": 2009,
    "overview": "Dr. Adrian Helmsley, part of a worldwide geophysical team investigating the effect on the earth of radiation from unprecedented solar storms, learns that the earth's core is heating up. He warns U.S. President Thomas Wilson that the crust of the earth is becoming unstable and that without proper preparations for saving a fraction of the world's population, the entire race is doomed. Meanwhile, writer Jackson Curtis stumbles on the same information. While the world's leaders race to build \"arks\" to escape the impending cataclysm, Curtis struggles to find a way to save his family. Meanwhile, volcanic eruptions and earthquakes of unprecedented strength wreak havoc around the world.",
    "popularity": 45.274225,
    "vote_average": 5.6,
    "vote_count": 4903,
    "budget": 200000000,
    "revenue": 769653595
  },
  {
    "id": 17979,
    "title": "A Christmas Carol",
    "genres": [
      "Animation",
      "Drama"
    ],
    "release_year": 2009,
    "overview": "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
    "popularity": 39.744242,
    "vote_average": 6.6,
    "vote_count": 1095,
    "budget": 200000000,
    "revenue": 325233863
  },
  {
    "id": 76757,
    "title": "Jupiter Ascending",
    "genres": [
      "Science Fiction",
      "Fantasy",
      "Action",
      "Adventure"
    ],
    "release_year": 2015,
    "overview": "In a universe where human genetic material is the most precious commodity, an impoverished young Earth woman becomes the key to strategic maneuvers and internal strife within a powerful dynasty…",
    "popularity": 85.36908,
    "vote_average": 5.2,
    "vote_count": 2768,
    "budget": 176000003,
    "revenue": 183987723
  },
  {
    "id": 258489,
    "title": "The Legend of Tarzan",
    "genres": [
      "Action",
      "Adventure"
    ],
    "release_year": 2016,
    "overview": "Tarzan, having acclimated to life in London, is called back to his former home in the jungle to investigate the activities at a mining encampment.",
    "popularity": 42.741719,
    "vote_average": 5.5,
    "vote_count": 2430,
    "budget": 180000000,
    "revenue": 356743061
  },
  {
    "id": 411,
    "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
    "genres": [
      "Adventure",
      "Family",
      "Fantasy"
    ],
    "release_year": 2005,
    "overview": "Siblings Lucy, Edmund, Susan and Peter step through a magical wardrobe and find the land of Narnia. There, the they discover a charming, once peaceful kingdom that has been plunged into eternal winter by the evil White Witch, Jadis. Aided by the wise and magnificent lion, Aslan, the children lead Narnia into a spectacular, climactic battle to be free of the Witch's glacial powers forever.",
    "popularity": 67.391328,
    "vote_average": 6.7,
    "vote_count": 2629,
    "budget": 180000000,
    "revenue": 748806957
  },
  {
    "id": 246655,
    "title": "X-Men: Apocalypse",
    "genres": [
      "Science Fiction"
    ],
    "release_year": 2016,
    "overview": "After the re-emergence of the world's first mutant, world-destroyer Apocalypse, the X-Men must unite to defeat his extinction level plan.",
    "popularity": 139.272042,
    "vote_average": 6.4,
    "vote_count": 4721,
    "budget": 178000000,
    "revenue": 543934787
  },
  {
    "id": 155,
    "title": "The Dark Knight",
    "genres": [
      "Drama",
      "Action",
      "Crime",
      "Thriller"
    ],
    "release_year": 2008,
    "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
    "popularity": 187.322927,
    "vote_average": 8.2,
    "vote_count": 12002,
    "budget": 185000000,
    "revenue": 1004558444
  },
  {
    "id": 14160,
    "title": "Up",
    "genres": [
      "Animation",
      "Comedy",
      "Family",
      "Adventure"
    ],
    "release_year": 2009,
    "overview": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
    "popularity": 92.201962,
    "vote_average": 7.7,
    "vote_count": 6870,
    "budget": 175000000,
    "revenue": 735099082
  },
  {
    "id": 15512,
    "title": "Monsters vs Aliens",
    "genres": [
      "Animation",
      "Family",
      "Adventure",
      "Science Fiction"
    ],
    "release_year": 2009,
    "overview": "When Susan Murphy is unwittingly clobbered by a meteor full of outer space gunk on her wedding day, she mysteriously grows to 49-feet-11-inches. The military jumps into action and captures Susan, secreting her away to a covert government compound. She is renamed Ginormica and placed in confinement with a ragtag group of Monsters...",
    "popularity": 36.167578,
    "vote_average": 6,
    "vote_count": 1423,
    "budget": 175000000,
    "revenue": 381509870
  },
  {
    "id": 1726,
    "title": "Iron Man",
    "genres": [
      "Action",
      "Science Fiction",
      "Adventure"
    ],
    "release_year": 2008,
    "overview": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
    "popularity": 120.725053,
    "vote_average": 7.4,
    "vote_count": 8776,
    "budget": 140000000,
    "revenue": 585174222
  },
  {
    "id": 44826,
    "title": "Hugo",
    "genres": [
      "Adventure",
      "Drama",
      "Family"
    ],
    "release_year": 2011,
    "overview": "Hugo is an orphan boy living in the walls of a train station in 1930s Paris. He learned to fix clocks and other gadgets from his father and uncle which he puts to use keeping the train station clocks running. The only thing that he has left that connects him to his dead father is an automaton (mechanical man) that doesn't work without a special key which Hugo needs to find to unlock the secret he believes it contains. On his adventures, he meets with a shopkeeper, George Melies, who works in the train station and his adventure-seeking god-daughter. Hugo finds that they have a surprising connection to his father and the automaton, and he discovers it unlocks some memories the old man has buried inside regarding his past.",
    "popularity": 32.319043,
    "vote_average": 7,
    "vote_count": 2141,
    "budget": 170000000,
    "revenue": 185770160
  },
  {
    "id": 8487,
    "title": "Wild Wild West",
    "genres": [
      "Action",
      "Adventure",
      "Comedy",
      "Science Fiction",
      "Western"
    ],
    "release_year": 1999,
    "overview": "Legless Southern inventor Dr. Arliss Loveless plans to rekindle the Civil War by assassinating President U.S. Grant. Only two men can stop him: gunfighter James West and master-of-disguise and inventor Artemus Gordon. The two must team up to thwart Loveless' plans.",
    "popularity": 40.748915,
    "vote_average": 5.1,
    "vote_count": 1020,
    "budget": 170000000,
    "revenue": 222104681
  },
  {
    "id": 1735,
    "title": "The Mummy: Tomb of the Dragon Emperor",
    "genres": [
      "Adventure",
      "Action",
      "Fantasy"
    ],
    "release_year": 2008,
    "overview": "Archaeologist Rick O'Connell travels to China, pitting him against an emperor from the 2,000-year-old Han dynasty who's returned from the dead to pursue a quest for world domination. This time, O'Connell enlists the help of his wife and son to quash the so-called 'Dragon Emperor' and his abuse of supernatural power.",
    "popularity": 60.034162,
    "vote_average": 5.2,
    "vote_count": 1387,
    "budget": 145000000,
    "revenue": 401128639
  },
  {
    "id": 297761,
    "title": "Suicide Squad",
    "genres": [
      "Action",
      "Adventure",
      "Crime",
      "Fantasy",
      "Science Fiction"
    ],
    "release_year": 2016,
    "overview": "From DC Comics comes the Suicide Squad, an antihero team of incarcerated supervillains who act as deniable assets for the United States government, undertaking high-risk black ops missions in exchange for commuted prison sentences.",
    "popularity": 90.23792,
    "vote_average": 5.9,
    "vote_count": 7458,
    "budget": 175000000,
    "revenue": 745000000
  },
  {
    "id": 2698,
    "title": "Evan Almighty",
    "genres": [
      "Fantasy",
      "Comedy",
      "Family"
    ],
    "release_year": 2007,
    "overview": "God contacts Congressman Evan Baxter and tells him to build an ark in preparation for a great flood.",
    "popularity": 27.082182,
    "vote_average": 5.3,
    "vote_count": 1151,
    "budget": 175000000,
    "revenue": 173000000
  },
  {
    "id": 137113,
    "title": "Edge of Tomorrow",
    "genres": [
      "Action",
      "Science Fiction"
    ],
    "release_year": 2014,
    "overview": "Major Bill Cage is an officer who has never seen a day of combat when he is unceremoniously demoted and dropped into combat. Cage is killed within minutes, managing to take an alpha alien down with him. He awakens back at the beginning of the same day and is forced to fight and die again... and again - as physical contact with the alien has thrown him into a time loop.",
    "popularity": 79.456485,
    "vote_average": 7.6,
    "vote_count": 4858,
    "budget": 178000000,
    "revenue": 370541256
  },
  {
    "id": 9804,
    "title": "Waterworld",
    "genres": [
      "Adventure",
      "Action"
    ],
    "release_year": 1995,
    "overview": "In a futuristic world where the polar ice caps have melted and made Earth a liquid planet, a beautiful barmaid rescues a mutant seafarer from a floating island prison. They escape, along with her young charge, Enola, and sail off aboard his ship. But the trio soon becomes the target of a menacing pirate who covets the map to 'Dryland' – which is tattooed on Enola's back.",
    "popularity": 44.640292,
    "vote_average": 5.9,
    "vote_count": 992,
    "budget": 175000000,
    "revenue": 264218220
  },
  {
    "id": 14869,
    "title": "G.I. Joe: The Rise of Cobra",
    "genres": [
      "Adventure",
      "Action",
      "Thriller",
      "Science Fiction"
    ],
    "release_year": 2009,
    "overview": "From the Egyptian desert to deep below the polar ice caps, the elite G.I. JOE team uses the latest in next-generation spy and military equipment to fight the corrupt arms dealer Destro and the growing threat of the mysterious Cobra organization to prevent them from plunging the world into chaos.",
    "popularity": 32.852443,
    "vote_average": 5.6,
    "vote_count": 1962,
    "budget": 175000000,
    "revenue": 302469017
  },
  {
    "id": 150540,
    "title": "Inside Out",
    "genres": [
      "Drama",
      "Comedy",
      "Animation",
      "Family"
    ],
    "release_year": 2015,
    "overview": "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school.",
    "popularity": 128.655964,
    "vote_average": 8,
    "vote_count": 6560,
    "budget": 175000000,
    "revenue": 857611174
  },
  {
    "id": 278927,
    "title": "The Jungle Book",
    "genres": [
      "Family",
      "Adventure",
      "Drama",
      "Fantasy"
    ],
    "release_year": 2016,
    "overview": "After a threat from the tiger Shere Khan forces him to flee the jungle, a man-cub named Mowgli embarks on a journey of self discovery with the help of panther, Bagheera, and free spirited bear, Baloo.",
    "popularity": 94.199316,
    "vote_average": 6.7,
    "vote_count": 2892,
    "budget": 175000000,
    "revenue": 966550600
  },
  {
    "id": 10138,
    "title": "Iron Man 2",
    "genres": [
      "Adventure",
      "Action",
      "Science Fiction"
    ],
    "release_year": 2010,
    "overview": "With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press and the public to share his technology with the military. Unwilling to let go of his invention, Stark, with Pepper Potts and James 'Rhodey' Rhodes at his side, must forge new alliances – and confront powerful enemies.",
    "popularity": 77.300194,
    "vote_average": 6.6,
    "vote_count": 6849,
    "budget": 200000000,
    "revenue": 623933331
  },
  {
    "id": 58595,
    "title": "Snow White and the Huntsman",
    "genres": [
      "Adventure",
      "Fantasy",
      "Drama"
    ],
    "release_year": 2012,
    "overview": "After the Evil Queen marries the King, she performs a violent coup in which the King is murdered and his daughter, Snow White, is taken captive. Almost a decade later, a grown Snow White is still in the clutches of the Queen. In order to obtain immortality, The Evil Queen needs the heart of Snow White. After Snow escapes the castle, the Queen sends the Huntsman to find her in the Dark Forest.",
    "popularity": 77.178973,
    "vote_average": 5.8,
    "vote_count": 3118,
    "budget": 170000000,
    "revenue": 396600000
  },
  {
    "id": 102651,
    "title": "Maleficent",
    "genres": [
      "Fantasy",
      "Adventure",
      "Action",
      "Family",
      "Romance"
    ],
    "release_year": 2014,
    "overview": "The untold story of Disney's most iconic villain from the 1959 classic 'Sleeping Beauty'. A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land.  Maleficent rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal – an act that begins to turn her heart into stone. Bent on revenge, Maleficent faces an epic battle with the invading King's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom - and to Maleficent's true happiness as well.",
    "popularity": 110.620647,
    "vote_average": 7,
    "vote_count": 4496,
    "budget": 180000000,
    "revenue": 758539785
  },
  {
    "id": 119450,
    "title": "Dawn of the Planet of the Apes",
    "genres": [
      "Science Fiction",
      "Action",
      "Drama",
      "Thriller"
    ],
    "release_year": 2014,
    "overview": "A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain dominance over his community of intelligent apes.",
    "popularity": 243.791743,
    "vote_average": 7.3,
    "vote_count": 4410,
    "budget": 170000000,
    "revenue": 710644566
  },
  {
    "id": 79698,
    "title": "The Lovers",
    "genres": [
      "Action",
      "Adventure",
      "Science Fiction",
      "Romance"
    ],
    "release_year": 2015,
    "overview": "The Lovers is an epic romance time travel adventure film. Helmed by Roland Joffé from a story by Ajey Jhankar, the film is a sweeping tale of an impossible love set against the backdrop of the first Anglo-Maratha war across two time periods and continents and centred around four characters — a British officer in 18th century colonial India, the Indian woman he falls deeply in love with, an American present-day marine biologist and his wife.",
    "popularity": 2.418535,
    "vote_average": 4.8,
    "vote_count": 34,
    "budget": 27000000,
    "revenue": 0
  },
  {
    "id": 64686,
    "title": "47 Ronin",
    "genres": [
      "Drama",
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "release_year": 2013,
    "overview": "Based on the original 1941 movie from Japan, and from ancient Japan’s most enduring tale, the epic 3D fantasy-adventure 47 Ronin is born.  Keanu Reeves leads the cast as Kai, an outcast who joins Oishi (Hiroyuki Sanada), the leader of the 47 outcast samurai.  Together they seek vengeance upon the treacherous overlord who killed their master and banished their kind.  To restore honor to their homeland, the warriors embark upon a quest that challenges them with a series of trials that would destroy ordinary warriors.",
    "popularity": 41.796339,
    "vote_average": 5.9,
    "vote_count": 1326,
    "budget": 175000000,
    "revenue": 150962475
  },
  {
    "id": 100402,
    "title": "Captain America: The Winter Soldier",
    "genres": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "release_year": 2014,
    "overview": "After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America is living quietly in Washington, D.C. and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy—the Winter Soldier.",
    "popularity": 72.225265,
    "vote_average": 7.6,
    "vote_count": 5764,
    "budget": 170000000,
    "revenue": 714766572
  },
  {
    "id": 10192,
    "title": "Shrek Forever After",
    "genres": [
      "Comedy",
      "Adventure",
      "Fantasy",
      "Animation",
      "Family"
    ],
    "release_year": 2010,
    "overview": "A bored and domesticated Shrek pacts with deal-maker Rumpelstiltskin to get back to feeling like a real ogre again, but when he's duped and sent to a twisted version of Far Far Away—where Rumpelstiltskin is king, ogres are hunted, and he and Fiona have never met—he sets out to restore his world and reclaim his true love.",
    "popularity": 44.041186,
    "vote_average": 6,
    "vote_count": 1959,
    "budget": 165000000,
    "revenue": 752600867
  },
  {
    "id": 158852,
    "title": "Tomorrowland",
    "genres": [
      "Adventure",
      "Family",
      "Mystery",
      "Science Fiction"
    ],
    "release_year": 2015,
    "overview": "Bound by a shared destiny, a bright, optimistic teen bursting with scientific curiosity and a former boy-genius inventor jaded by disillusionment embark on a danger-filled mission to unearth the secrets of an enigmatic place somewhere in time and space that exists in their collective memory as \"Tomorrowland.\"",
    "popularity": 130.311355,
    "vote_average": 6.2,
    "vote_count": 2846,
    "budget": 190000000,
    "revenue": 209154322
  },
  {
    "id": 177572,
    "title": "Big Hero 6",
    "genres": [
      "Adventure",
      "Family",
      "Animation",
      "Action",
      "Comedy"
    ],
    "release_year": 2014,
    "overview": "The special bond that develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.",
    "popularity": 203.73459,
    "vote_average": 7.8,
    "vote_count": 6135,
    "budget": 165000000,
    "revenue": 652105443
  },
  {
    "id": 82690,
    "title": "Wreck-It Ralph",
    "genres": [
      "Family",
      "Animation",
      "Comedy",
      "Adventure"
    ],
    "release_year": 2012,
    "overview": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
    "popularity": 62.341073,
    "vote_average": 7.1,
    "vote_count": 4570,
    "budget": 165000000,
    "revenue": 471222889
  },
  {
    "id": 5255,
    "title": "The Polar Express",
    "genres": [
      "Adventure",
      "Animation",
      "Family",
      "Fantasy"
    ],
    "release_year": 2004,
    "overview": "When a doubting young boy takes an extraordinary train ride to the North Pole, he embarks on a journey of self-discovery that shows him that the wonder of life never fades for those who believe.",
    "popularity": 47.323228,
    "vote_average": 6.4,
    "vote_count": 1474,
    "budget": 165000000,
    "revenue": 305875730
  },
  {
    "id": 47933,
    "title": "Independence Day: Resurgence",
    "genres": [
      "Action",
      "Adventure",
      "Science Fiction"
    ],
    "release_year": 2016,
    "overview": "We always knew they were coming back. Using recovered alien technology, the nations of Earth have collaborated on an immense defense program to protect the planet. But nothing can prepare us for the aliens’ advanced and unprecedented force. Only the ingenuity of a few brave men and women can bring our world back from the brink of extinction.",
    "popularity": 48.775723,
    "vote_average": 4.9,
    "vote_count": 2491,
    "budget": 165000000,
    "revenue": 389681935
  },
  {
    "id": 10191,
    "title": "How to Train Your Dragon",
    "genres": [
      "Fantasy",
      "Adventure",
      "Animation",
      "Family"
    ],
    "release_year": 2010,
    "overview": "As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his warrior mettle. But after downing a feared dragon, he realizes that he no longer wants to destroy it, and instead befriends the beast – which he names Toothless – much to the chagrin of his warrior father",
    "popularity": 67.263269,
    "vote_average": 7.5,
    "vote_count": 4227,
    "budget": 165000000,
    "revenue": 494878759
  },
  {
    "id": 296,
    "title": "Terminator 3: Rise of the Machines",
    "genres": [
      "Action",
      "Thriller",
      "Science Fiction"
    ],
    "release_year": 2003,
    "overview": "It's been 10 years since John Connor saved Earth from Judgment Day, and he's now living under the radar, steering clear of using anything Skynet can trace. That is, until he encounters T-X, a robotic assassin ordered to finish what T-1000 started. Good thing Connor's former nemesis, the Terminator, is back to aid the now-adult Connor … just like he promised.",
    "popularity": 69.405188,
    "vote_average": 5.9,
    "vote_count": 2143,
    "budget": 200000000,
    "revenue": 435000000
  },
  {
    "id": 118340,
    "title": "Guardians of the Galaxy",
    "genres": [
      "Action",
      "Science Fiction",
      "Adventure"
    ],
    "release_year": 2014,
    "overview": "Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.",
    "popularity": 481.098624,
    "vote_average": 7.9,
    "vote_count": 9742,
    "budget": 170000000,
    "revenue": 773328629
  },
  {
    "id": 157336,
    "title": "Interstellar",
    "genres": [
      "Adventure",
      "Drama",
      "Science Fiction"
    ],
    "release_year": 2014,
    "overview": "Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
    "popularity": 724.247784,
    "vote_average": 8.1,
    "vote_count": 10867,
    "budget": 165000000,
    "revenue": 675120017
  },
  {
    "id": 27205,
    "title": "Inception",
    "genres": [
      "Action",
      "Thriller",
      "Science Fiction",
      "Mystery",
      "Adventure"
    ],
    "release_year": 2010,
    "overview": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
    "popularity": 167.58371,
    "vote_average": 8.1,
    "vote_count": 13752,
    "budget": 160000000,
    "revenue": 825532764
  },
  {
    "id": 315011,
    "title": "Shin Godzilla",
    "genres": [
      "Action",
      "Adventure",
      "Drama",
      "Horror",
      "Science Fiction"
    ],
    "release_year": 2016,
    "overview": "From the mind behind Evangelion comes a hit larger than life.  When a massive, gilled monster emerges from the deep and tears through the city, the government scrambles to save its citizens.  A rag-tag team of volunteers cuts through a web of red tape to uncover the monster's weakness and its mysterious ties to a foreign superpower.  But time is not on their side - the greatest catastrophe to ever befall the world is about to evolve right before their very eyes.",
    "popularity": 9.476999,
    "vote_average": 6.5,
    "vote_count": 143,
    "budget": 15000000,
    "revenue": 77000000
  },
  {
    "id": 49051,
    "title": "The Hobbit: An Unexpected Journey",
    "genres": [
      "Adventure",
      "Fantasy",
      "Action"
    ],
    "release_year": 2012,
    "overview": "Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mountain home from Smaug, the dragon.",
    "popularity": 108.849621,
    "vote_average": 7,
    "vote_count": 8297,
    "budget": 250000000,
    "revenue": 1021103568
  },
  {
    "id": 9799,
    "title": "The Fast and the Furious",
    "genres": [
      "Action",
      "Crime",
      "Thriller"
    ],
    "release_year": 2001,
    "overview": "Domenic Toretto is a Los Angeles street racer suspected of masterminding a series of big-rig hijackings. When undercover cop Brian O'Conner infiltrates Toretto's iconoclastic crew, he falls for Toretto's sister and must choose a side: the gang or the LAPD.",
    "popularity": 6.909942,
    "vote_average": 6.6,
    "vote_count": 3428,
    "budget": 38000000,
    "revenue": 207283925
  }
]